data_classes = {
    '1', '2', '3', '4', '5', '6', '7', '8', '9', '10', '11',
    'А', "Б", "В", "Г", "Д", "а", "б", "в", "г", "д",
    'A', 'a', 'B', 'b',
}

days = {
    'именительный': {
        '1': 'Понедельник',
        '2': 'Вторник',
        '3': 'Среда',
        '4': 'Четверг',
        '5': 'Пятница',
        '6': 'Суббота',
        '0': 'Воскресенье',
    },
    'родительный': {
        '1': 'Понедельник',
        '2': 'Вторник',
        '3': 'Среду',
        '4': 'Четверг',
        '5': 'Пятницу',
        '6': 'Субботу',
        '0': 'Воскресенье',
    },
}

data_teachers = {
    'моисеева': {
        'именительный': 'Моисеева Е. Ю.',
        'родительный': 'Моисееву Е.Ю.',
        'дательный': 'Моисеевой Е.Ю.',
        'предметы': {
            '1': 'История',
            '2': 'Обществознание',
            '3': '',
            '4': '',
            '5': ''
        },
    },
    'ярцева': {
        'именительный': 'Ярцева И. И.',
        'родительный': 'Ярцеву И.И.',
        'дательный': '',
        'предметы': {
            '1': 'История',
            '2': 'Обществознание',
            '3': '',
            '4': '',
            '5': ''

        }
    },
    'алейкина': {
        'именительный': 'Алейкина Т. В.',
        'родительный': 'Алейкину Т. В.',
        'дательный': '',
        'предметы': {
            '1': '',
            '2': '',
            '3': '',
            '4': '',
            '5': ''
        }
    },
    'лукинская': {
        'именительный': 'Лукинская Н. С.',
        'родительный': 'Лукинскую Н. С.',
        'дательный': '',
        'предметы': {
            '1': 'История',
            '2': 'Обществознание',
            '3': '',
            '4': '',
            '5': ''
        }
    },
    'нужа': {
        'именительный': 'Нужа Н. А.',
        'родительный': 'Нужу Н. А.',
        'дательный': '',
        'предметы': {
            '1': 'История',
            '2': 'Обществознание',
            '3': '',
            '4': '',
            '5': ''
        }
    },
    'сорокина': {
        'именительный': 'Сорокина Т. Н.',
        'родительный': 'Сорокину Т. Н.',
        'дательный': '',
        'предметы': {
            '1': 'История',
            '2': 'Обществознание',
            '3': '',
            '4': '',
            '5': ''
        }
    },
    'нестерова': {
        'именительный': 'Нестерова Г. А.',
        'родительный': 'Нестерову Г. А.',
        'дательный': '',
        'предметы': {
            '1': 'История',
            '2': 'Обществознание',
            '3': '',
            '4': '',
            '5': ''
        }
    },
    'сискутова': {
        'именительный': 'Сискутова Е. Л.',
        'родительный': 'Сискутову Е. Л.',
        'дательный': '',
        'предметы': {
            '1': 'История',
            '2': 'Обществознание',
            '3': '',
            '4': '',
            '5': ''
        }
    },
    'афонина': {
        'именительный': 'Афонина З. С. ',
        'родительный': 'Афонину З. С. ',
        'дательный': '',
        'предметы': {
            '1': 'История',
            '2': 'Обществознание',
            '3': '',
            '4': '',
            '5': ''
        }
    },
    'ковальская': {
        'именительный': 'Ковальская Т. В.',
        'родительный': 'Ковальскую Т. В.',
        'дательный': '',
        'предметы': {
            '1': 'История',
            '2': 'Обществознание',
            '3': '',
            '4': '',
            '5': ''
        }
    },
    'каширская': {
        'именительный': 'Каширская И. В.',
        'родительный': 'Каширскую И. В.',
        'дательный': '',
        'предметы': {
            '1': '',
            '2': '',
            '3': '',
            '4': '',
            '5': ''
        }
    },
    'трушина': {
        'именительный': 'Трушина И. Г.',
        'родительный': 'Трушину И. Г.',
        'дательный': '',
        'предметы': {
            '1': '',
            '2': '',
            '3': '',
            '4': '',
            '5': ''
        }
    },
    'воробьев': {
        'именительный': 'Воробьев Ю. Н.',
        'родительный': 'Воробьеву Ю. Н.',
        'дательный': '',
        'предметы': {
            '1': '',
            '2': '',
            '3': '',
            '4': '',
            '5': ''
        }
    },
    'королева': {
        'именительный': 'Королева Т. П.',
        'родительный': 'Королеву Т. П.',
        'дательный': '',
        'предметы': {
            '1': '',
            '2': '',
            '3': '',
            '4': '',
            '5': ''
        }
    },
    'лутонина': {
        'именительный': 'Лутонина Г. Н.',
        'родительный': 'Лутонину Г. Н.',
        'дательный': '',
        'предметы': {
            '1': '',
            '2': '',
            '3': '',
            '4': '',
            '5': ''
        }
    },
    'аверкина': {
        'именительный': 'Аверкина М. В.',
        'родительный': 'Аверкину М. В.',
        'дательный': '',
        'предметы': {
            '1': '',
            '2': '',
            '3': '',
            '4': '',
            '5': ''
        }
    },
    'зинов': {
        'именительный': 'Зинов В. Н.',
        'родительный': 'Зинова В. Н.',
        'дательный': '',
        'предметы': {
            '1': '',
            '2': '',
            '3': '',
            '4': '',
            '5': ''
        }
    },
    'соловьева': {
        'именительный': 'Соловьева Е. В.',
        'родительный': 'Соловьеву Е. В.',
        'дательный': '',
        'предметы': {
            '1': '',
            '2': '',
            '3': '',
            '4': '',
            '5': ''
        }
    },
    'лыгина': {
        'именительный': 'Лыгина Н. Е.',
        'родительный': 'Лыгину Н. Е.',
        'дательный': '',
        'предметы': {
            '1': '',
            '2': '',
            '3': '',
            '4': '',
            '5': ''
        }
    },
    'гречихина': {
        'именительный': 'Гречихина И. Ю.',
        'родительный': 'Гречихину И. Ю.',
        'дательный': '',
        'предметы': {
            '1': '',
            '2': '',
            '3': '',
            '4': '',
            '5': ''
        }
    },
    'лукьянова': {
        'именительный': 'Лукьянова Е. Ю.',
        'родительный': 'Лукьянову Е. Ю.',
        'дательный': '',
        'предметы': {
            '1': '',
            '2': '',
            '3': '',
            '4': '',
            '5': ''
        }
    },
    'воробьева': {
        'именительный': 'Воробьева О. А.',
        'родительный': 'Воробьеву О. А.',
        'дательный': '',
        'предметы': {
            '1': '',
            '2': '',
            '3': '',
            '4': '',
            '5': ''
        }
    },
    'ещева': {
        'именительный': 'Ещева И. В.',
        'родительный': 'Ещеву И. В.',
        'дательный': '',
        'предметы': {
            '1': '',
            '2': '',
            '3': '',
            '4': '',
            '5': ''
        }
    },
    'сафонова': {
        'именительный': 'Сафонова А. А.',
        'родительный': 'Сафонову А. А.',
        'дательный': '',
        'предметы': {
            '1': '',
            '2': '',
            '3': '',
            '4': '',
            '5': ''
        }
    },
    'курапова': {
        'именительный': 'Курапова С. Ю.',
        'родительный': 'Курапову С. Ю.',
        'дательный': '',
        'предметы': {
            '1': '',
            '2': '',
            '3': '',
            '4': '',
            '5': ''
        }
    },
    'гвоздикова': {
        'именительный': 'Гвоздикова А. Ю.',
        'родительный': 'Гвоздикову А. Ю.',
        'дательный': '',
        'предметы': {
            '1': '',
            '2': '',
            '3': '',
            '4': '',
            '5': ''
        }
    },
    'литвинова': {
        'именительный': 'Литвинова Т. В.',
        'родительный': 'Литвинову Т. В.',
        'дательный': '',
        'предметы': {
            '1': '',
            '2': '',
            '3': '',
            '4': '',
            '5': ''
        }
    },
    'кулакова': {
        'именительный': 'Кулакова Ж. В.',
        'родительный': 'Кулакову Ж. В.',
        'дательный': '',
        'предметы': {
            '1': '',
            '2': '',
            '3': '',
            '4': '',
            '5': ''
        }
    },
    'балавина': {
        'именительный': 'Балавина П. С.',
        'родительный': 'Балавину П. С.',
        'дательный': '',
        'предметы': {
            '1': '',
            '2': '',
            '3': '',
            '4': '',
            '5': ''
        }
    },
    'гуськова': {
        'именительный': 'Гуськова И. К.',
        'родительный': 'Гуськову И. К.',
        'дательный': '',
        'предметы': {
            '1': '',
            '2': '',
            '3': '',
            '4': '',
            '5': ''
        }
    },
    'сазыкин': {
        'именительный': 'Сазыкин В. А.',
        'родительный': 'Сазыкина В. А.',
        'дательный': '',
        'предметы': {
            '1': '',
            '2': '',
            '3': '',
            '4': '',
            '5': ''
        }
    },
    'ермакина': {
        'именительный': 'Ермакина М. Д.',
        'родительный': 'Ермакину М. Д.',
        'дательный': '',
        'предметы': {
            '1': '',
            '2': '',
            '3': '',
            '4': '',
            '5': ''
        }
    },
    'лагода': {
        'именительный': 'Лагода О. А.',
        'родительный': 'Лагоду О. А.',
        'дательный': '',
        'предметы': {
            '1': '',
            '2': '',
            '3': '',
            '4': '',
            '5': ''
        }
    },
    'беляева': {
        'именительный': 'Беляева Т. А.',
        'родительный': 'Беляеву Т. А.',
        'дательный': '',
        'предметы': {
            '1': '',
            '2': '',
            '3': '',
            '4': '',
            '5': ''
        }
    },
    'кузьмина': {
        'именительный': 'Кузьмина А. С.',
        'родительный': 'Кузьмину А. С.',
        'дательный': '',
        'предметы': {
            '1': '',
            '2': '',
            '3': '',
            '4': '',
            '5': ''
        }
    },
    'кузнецова': {
        'именительный': 'Кузнецова А. С.',
        'родительный': 'Кузнецову А. С.',
        'дательный': '',
        'предметы': {
            '1': '',
            '2': '',
            '3': '',
            '4': '',
            '5': ''
        }
    },
    'селибова': {
        'именительный': 'Селибова Н. И.',
        'родительный': 'Селибову Н. И.',
        'дательный': '',
        'предметы': {
            '1': '',
            '2': '',
            '3': '',
            '4': '',
            '5': ''
        }
    },
    'скворцова': {
        'именительный': 'Скворцова О. В.',
        'родительный': 'Скворцову О. В.',
        'дательный': '',
        'предметы': {
            '1': '',
            '2': '',
            '3': '',
            '4': '',
            '5': ''
        }
    },
    'киндинова': {
        'именительный': 'Киндинова Г. Г.',
        'родительный': 'Киндинову Г. Г.',
        'дательный': '',
        'предметы': {
            '1': '',
            '2': '',
            '3': '',
            '4': '',
            '5': ''
        }
    },
    'болквадзе': {
        'именительный': 'Болквадзе Н. В.',
        'родительный': 'Болквадзе Н. В.',
        'дательный': '',
        'предметы': {
            '1': '',
            '2': '',
            '3': '',
            '4': '',
            '5': ''
        }
    },
    'халявина': {
        'именительный': 'Халявина Л. Ю.',
        'родительный': 'Халявину Л. Ю.',
        'дательный': '',
        'предметы': {
            '1': '',
            '2': '',
            '3': '',
            '4': '',
            '5': ''
        }
    },
}

data_truth = [
    'ты очень сегодня красивая!',
    'тебя приятно снова и снова видеть!',
    'ты очень мила...',
    'помни, что ты лучше всех!',
    'если хочешь увидеть сегодня что-то прекрасное - взгляни в зеркало.',
]

data_replace = {

}