data_classes = {
    '1', '2', '3', '4', '5', '6', '7', '8', '9', '10', '11',
    'А', "Б", "В", "Г", "Д", "а", "б", "в", "г", "д",
    'A', 'a', 'B', 'b',
}

days = {
    '1': {
        '1': 'Понедельник',
        '2': 'Вторник',
        '3': 'Среда',
        '4': 'Четверг',
        '5': 'Пятница',
        '6': 'Суббота',
        '7': 'Воскресенье',
    },
    '2': {
        '1': 'Понедельник',
        '2': 'Вторник',
        '3': 'Среду',
        '4': 'Четверг',
        '5': 'Пятницу',
        '6': 'Субботу',
        '7': 'Воскресенье',
    },
}

data_teachers = {
    'моисеева': {
        'именительный': 'Моисеева Е. Ю.',
        'родительный': 'Моисееву Е.Ю.',
        'предметы': {
            '1': 'История',
            '2': 'Обществознание',
            '3': '',
            '4': '',
            '5': ''
        }
    }
}


data_replace = {

}